tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/hw/r_usb_hreg_abs.c
    /***** Processing PIPE0-MAX_PIPE_NO data *****/
    else if ((ists0 & USB_BRDY) == USB_BRDY) /***** EP0-7 BRDY *****/
    {
        ptr->ipp->BRDYSTS.WORD = (uint16_t) ((~bsts) & BRDYSTS_MASK);
        ptr->keyword = USB_INT_BRDY;
        ptr->status = bsts;
    }
    else if ((ists0 & USB_BEMP) == USB_BEMP) /***** EP0-7 BEMP *****/
    {
        ptr->ipp->BEMPSTS.WORD = (uint16_t) ((~ests) & BEMPSTS_MASK);
        ptr->keyword = USB_INT_BEMP;
        ptr->status = ests;
    }
    else if ((ists0 & USB_NRDY) == USB_NRDY) /***** EP0-7 NRDY *****/
    {
        ptr->ipp->NRDYSTS.WORD = (uint16_t) ((~nsts) & NRDYSTS_MASK);
        ptr->keyword = USB_INT_NRDY;
        ptr->status = nsts;
    }

    /***** Processing rootport0 *****/
    else if ((ists1 & USB_OVRCR) == USB_OVRCR) /***** OVER CURRENT *****/
    {
        /* OVRCR Clear */
        ptr->ipp->INTSTS1.WORD = (uint16_t) ((~USB_OVRCR) & INTSTS1_MASK);
        ptr->keyword = USB_INT_OVRCR0;
    }
    else if ((ists1 & USB_ATTCH) == USB_ATTCH) /***** ATTCH INT *****/
    {
        /* DTCH  interrupt disable */
        usb_hstd_bus_int_disable(ptr, (uint16_t) USB_PORT0);
        ptr->keyword = USB_INT_ATTCH0;
    }
    else if ((ists1 & USB_EOFERR) == USB_EOFERR) /***** EOFERR INT *****/
    {
        /* EOFERR Clear */
        ptr->ipp->INTSTS1.WORD = (uint16_t) ((~USB_EOFERR) & INTSTS1_MASK);
        ptr->keyword = USB_INT_EOFERR0;
    }
    else if ((ists1 & USB_BCHG) == USB_BCHG) /***** BCHG INT *****/
    {
        /* BCHG  interrupt disable */
        usb_hstd_bchg_disable(ptr, (uint16_t) USB_PORT0);
        ptr->keyword = USB_INT_BCHG0;
    }
    else if ((ists1 & USB_DTCH) == USB_DTCH) /***** DETACH *****/
    {
        /* DTCH  interrupt disable */
        usb_hstd_bus_int_disable(ptr, (uint16_t) USB_PORT0);
        ptr->keyword = USB_INT_DTCH0;
    }
#if USB_CFG_BC == USB_CFG_ENABLE
    else if ((ists1 & USB_PDDETINT) == USB_PDDETINT) /***** PDDETINT INT *****/
    {
        if (USB_USBIP_1 == ptr -> ip)
        {
            /* PDDETINT  interrupt disable */
            ptr->ipp1->INTSTS1.WORD = (uint16_t) ((~USB_PDDETINT) & INTSTS1_MASK);
            ptr->keyword = USB_INT_PDDETINT0;
        }
    }
#endif  /* USB_CFG_BC == USB_CFG_ENABLE */
    /***** Processing VBUS/SOF *****/
    else if ((ists0 & USB_VBINT) == USB_VBINT) /***** VBUS change *****/
    {
        /* Status Clear */
        ptr->ipp->INTSTS0.WORD = (uint16_t) ~USB_VBINT;
        ptr->keyword = USB_INT_VBINT;
    }
    else if ((ists0 & USB_SOFR) == USB_SOFR) /***** SOFR change *****/
    {
        /* SOFR Clear */
        ptr->ipp->INTSTS0.WORD = (uint16_t) ~USB_SOFR;
        ptr->keyword = USB_INT_SOFR;
    }

    else
    {
        /* Non */
    }
}
/******************************************************************************
 End of function usb_hstd_interrupt_handler
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_chk_attach
 Description     : Checks whether USB Device is attached or not and return USB speed
                 : of USB Device
 Arguments       : usb_utr_t *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t port     : port number
 Return value    : uint16_t          : connection status
                 :                   : (USB_ATTACHF/USB_ATTACHL/USB_DETACH/USB_OK)
 Note            : Please change for your SYSTEM
 ******************************************************************************/
uint16_t usb_hstd_chk_attach (usb_utr_t *ptr, uint16_t port)
{
    uint16_t buf[3];

    usb_hstd_read_lnst(ptr, port, buf);

    if ((uint16_t) (buf[1] & USB_RHST) == USB_UNDECID)
    {
        if ((buf[0] & USB_LNST) == USB_FS_JSTS)
        {
            /* High/Full speed device */
            USB_PRINTF0(" Detect FS-J\n");
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
            usb_hstd_set_hse(ptr, port, g_usb_hstd_hs_enable[ptr->ip]);
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
            return USB_ATTACHF;
        }
        else if ((buf[0] & USB_LNST) == USB_LS_JSTS)
        {
            /* Low speed device */
            USB_PRINTF0(" Attach LS device\n");
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
            usb_hstd_set_hse(ptr, port, USB_HS_DISABLE);
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
            return USB_ATTACHL;
        }
        else if ((buf[0] & USB_LNST) == USB_SE0)
        {
            USB_PRINTF0(" Detach device\n");
        }
        else
        {
            USB_PRINTF0(" Attach unknown speed device\n");
        }
    }
    else
    {
        USB_PRINTF0(" Already device attached\n");
        return USB_OK;
    }
    return USB_DETACH;
}
/******************************************************************************
 End of function usb_hstd_chk_attach
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_chk_clk
 Description     : Checks SOF sending setting when USB Device is detached or suspended
                 : , BCHG interrupt enable setting and clock stop processing
 Arguments       : usb_utr_t *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t port     : port number
                 : uint16_t event    : device state
 Return value    : none
 ******************************************************************************/
void usb_hstd_chk_clk (usb_utr_t *ptr, uint16_t port, uint16_t event)
{

    if ((USB_DETACHED == g_usb_hstd_mgr_mode[ptr->ip][USB_PORT0])
            || (USB_SUSPENDED == g_usb_hstd_mgr_mode[ptr->ip][USB_PORT0]))
    {
        usb_hstd_chk_sof(ptr, (uint16_t) USB_PORT0);

        /* Enable port BCHG interrupt */
        usb_hstd_bchg_enable(ptr, (uint16_t) USB_PORT0);
    }

} /* End of function usb_hstd_chk_clk */
/******************************************************************************
 End of function usb_hstd_chk_clk
 ******************************************************************************/

