tamapochi1/Sonar/Documents/an_r01an2238jj0121_usb/workspace/RX64M/r_usb_basic/src/hw/r_usb_hreg_abs.c
/******************************************************************************
 Function Name   : usb_hstd_detach_process
 Description     : Handles the require processing when USB device is detached
                 : (Data transfer forcibly termination processing to the connected USB Device,
                 : the clock supply stop setting and the USB interrupt dissable setteing etc)
 Arguments       : usb_utr_t *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t port     : port number
 Return value    : none
 ******************************************************************************/
void usb_hstd_detach_process (usb_utr_t *ptr, uint16_t port)
{
    uint16_t connect_inf;
    uint16_t md;
    uint16_t i;
    uint16_t addr;

    /* ATTCH interrupt disable */
    usb_hstd_attch_disable(ptr, port);

    /* DTCH  interrupt disable */
    usb_hstd_dtch_disable(ptr, port);
    usb_hstd_bchg_disable(ptr, (uint16_t) USB_PORT0);

    for (md = 1u; md < (USB_MAXDEVADDR + 1u); md++)
    {
        addr = (uint16_t) (md << USB_DEVADDRBIT);
        if (usb_hstd_chk_dev_addr(ptr, addr, port) != USB_NOCONNECT)
        {
            if (USB_IDLEST != g_usb_hstd_ctsq[ptr->ip])
            {
                /* Control Read/Write End */
                usb_hstd_ctrl_end(ptr, (uint16_t) USB_DATA_ERR);
            }
            for (i = USB_MIN_PIPE_NO; i <= USB_MAX_PIPE_NO; i++)
            {
                /* Not control transfer */
                /* Agreement device address */
                if (usb_hstd_get_devsel(ptr, i) == addr)
                {
                    /* PID=BUF ? */
                    if (usb_cstd_get_pid(ptr, i) == USB_PID_BUF)
                    {
                        /* End of data transfer (IN/OUT) */
                        usb_hstd_forced_termination(ptr, i, (uint16_t) USB_DATA_STOP);
                    }
                    usb_cstd_clr_pipe_cnfg(ptr, i);
                }
            }
            usb_hstd_set_dev_addr(ptr, addr, USB_OK, USB_OK);
            usb_hstd_set_hub_port(ptr, addr, USB_OK, USB_OK);
            USB_PRINTF1("*** Device address %d clear.\n",md);
        }
    }

    /* Decide USB Line state (ATTACH) */
    connect_inf = usb_hstd_chk_attach(ptr, port);
    switch (connect_inf)
    {
        case USB_ATTACHL :
            usb_hstd_attach(ptr, connect_inf, port);
        break;
        case USB_ATTACHF :
            usb_hstd_attach(ptr, connect_inf, port);
        break;
        case USB_DETACH :

            /* USB detach */
            usb_hstd_detach(ptr, port);

            /* Check clock */
            usb_hstd_chk_clk(ptr, port, (uint16_t) USB_DETACHED);
        break;
        default :

            /* USB detach */
            usb_hstd_detach(ptr, port);

            /* Check clock */
            usb_hstd_chk_clk(ptr, port, (uint16_t) USB_DETACHED);
        break;
    }
}
/******************************************************************************
 End of function usb_hstd_detach_process
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_read_lnst
 Description     : Reads LNST register two times, checks whether these values
                 : are equal and returns the value of DVSTCTR register that correspond to
                 : the port specified by 2nd argument.
 Arguments       : usb_utr_t *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t port     : port number
                 : uint16_t *buf     : Pointer to the buffer to store DVSTCTR register
 Return value    : none
 Note            : Please change for your SYSTEM
 ******************************************************************************/
void usb_hstd_read_lnst (usb_utr_t *ptr, uint16_t port, uint16_t *buf)
{
    do
    {
        buf[0] = hw_usb_read_syssts(ptr, port);

        /* 30ms wait */
        usb_cpu_delay_xms((uint16_t) 30);
        buf[1] = hw_usb_read_syssts(ptr, port);
        if ((buf[0] & USB_LNST) == (buf[1] & USB_LNST))
        {
            /* 20ms wait */
            usb_cpu_delay_xms((uint16_t) 20);
            buf[1] = hw_usb_read_syssts(ptr, port);
        }
    } while ((buf[0] & USB_LNST) != (buf[1] & USB_LNST));
    buf[1] = hw_usb_read_dvstctr(ptr, port);
}
/******************************************************************************
 End of function usb_hstd_read_lnst
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hstd_attach_process
 Description     : Interrupt disable setting when USB Device is attached and
                 : handles the required interrupt disable setting etc when USB device
                 : is attached.
 Arguments       : usb_utr_t *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t port     : port number
 Return value    : none
 Note            : Please change for your SYSTEM
 ******************************************************************************/
void usb_hstd_attach_process (usb_utr_t *ptr, uint16_t port)
{
    uint16_t connect_inf;

    /* ATTCH interrupt disable */
    usb_hstd_attch_disable(ptr, port);

    /* DTCH  interrupt disable */
    usb_hstd_dtch_disable(ptr, port);
    usb_hstd_bchg_disable(ptr, (uint16_t) USB_PORT0);

    /* Decide USB Line state (ATTACH) */
    connect_inf = usb_hstd_chk_attach(ptr, port);
    switch (connect_inf)
    {
        case USB_ATTACHL :
            usb_hstd_attach(ptr, connect_inf, port);
        break;
        case USB_ATTACHF :
            usb_hstd_attach(ptr, connect_inf, port);
        break;
        case USB_DETACH :

            /* USB detach */
            usb_hstd_detach(ptr, port);

            /* Check clock */
            usb_hstd_chk_clk(ptr, port, (uint16_t) USB_DETACHED);
        break;
        default :
            usb_hstd_attach(ptr, (uint16_t) USB_ATTACHF, port);
        break;
    }
}
/******************************************************************************
 End of function usb_hstd_attach_process
 ******************************************************************************/

